<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"3995eaa6b7b55581f0f13497ae61cc43473149d2568258f7ce0c3ca6c1bc5bee","plan_job_ref":"Job Test terraform-refresh #32 at https://github.com/dflook/terraform-github-actions/actions/runs/15321148733","plan_out_hash":"997a9c6793313825f1236be4cef8730c18ba58c3b63d44ed7bbeb250cfd23ebd","plan_hash":"4ff86a5066730f77c915bda90071cb2ef1744bb2c4e07320e07602c488890a53","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #32](https://github.com/dflook/terraform-github-actions/actions/runs/15321148733)